[
  {
    "title": "Featured",
    "entries": [
      "Chaos Pillars",
      "Loot chaos keys from monsters to unlock chaos pillars spawning monster packs with random modifiers, will you risk it??"
    ]
  },
  {
    "title": "Bard Class",
    "entries": [
      "New mage/warrior class (lightning / Phys / Fire). Bard brings the Metal to Tarethiel!"
    ]
  },
  {
    "title": "Endrixia - Ruby Garden",
    "entries": [
      "Ruby Garden now has a boss in it; Endrixia, an ancient dragon. Dare to awaken her? Endrixia has an unique pool of items she drops."
    ]
  },
  {
    "title": "Rogue Chaos Tower - Codex of Chaos",
    "entries": [
      "Codex of Chaos has a chance to spawn a rogue chaos tower with its unique pool of items it drops."
    ]
  },
  {
    "title": "Sheep King",
    "entries": [
      "Sheep King re-worked into an actual boss."
    ]
  },
  {
    "title": "Stash",
    "entries": [
      "You can now sort stash tabs and the container is scrollable + tabs scale in size with the name of the tab"
    ]
  },
  {
    "title": "Localization",
    "entries": [
      "Added proper Korean localizations to the game (Done by community member Rupers)",
      "Added proper Japanese localizations to the game (Done by community member Rupers)"
    ]
  },
  {
    "title": "Waypoints",
    "entries": [
      "Added session based waypoints into the last boss dungeon floors which are disabled after session is reset."
    ]
  },
  {
    "title": "Skins",
    "entries": [
      "Dark Ages skin for Bard",
      "Maid Squad skin bundle for Pirate, Illusionist and Stormweaver",
      "Capybara companion"
    ]
  },
  {
    "title": "General",
    "entries": [
      "Massive performance improvements",
      "Added new achievement: Destroy 100 slot machines",
      "Improved jumping by adding a system that automatically extends a jump over voids if the length is too small and it is within the maximum range.",
      "Sub Skill big nodes now open at level 40 / 70 / 100",
      "Fixed Inferno odin achievement",
      "Increased performance for multiprojectile skills",
      "UI scaling for wide screen monitors added",
      "Added new default section to journal which explains certain game mechanics to the player",
      "Optimized projectile collision checks"
    ]
  },
  {
    "title": "Blood Pact",
    "entries": [
      "Hero Siege now supports 50, 100 and 250 player blood pacts",
      "Anyone in the pact is now able to extend the duration of the pact with a token",
      "The pact leader can now change pact settings after starting the pact (2 times per pact)",
      "Blood Pacts now have their own global chat and drop announcements",
      "Changed Dimensional Shards requirement to 10-80",
      "Changed Battle Fragment requirement to 10-100",
      "Added slider for Colosseum Fragments requirement 10-100",
      "Added slider for increased Satanic drops (non SS) -50% to +50%",
      "Added slider for Relic Drops -50% to +50%",
      "Added slider for Extra Gold per monster kill for -25% to +100%",
      "Added slider for Boss Gem drop rates -50% to +50%",
      "Added slider for Angelic Rune drop rates -50% to +50%",
      "Added slider for extra ore drops 0-5",
      "Added slider for Bifröst Key drop rates -50% to +50%",
      "Added slider for extra monster life 0% to 500%",
      "Added slider for extra monster damage 0% to 250%",
      "Added slider for Scroll of Ra drop rates -50% to +50%",
      "Added slider for Orb drop rates -50% to +50%"
    ]
  },
  {
    "title": "Shrines & NPC",
    "entries": [
      "Geras SS tier chance on inferno lowered from 3% to 1% per item",
      "Doubled the speed of gamba machine",
      "Geras can now spawn as norma, superior, rare, mythic, satanic or angelic adding items to the shop according to the rarity also increasing chances for better items",
      "Veras can now spawn as norma, superior, rare, mythic, satanic or angelic adding items to the shop according to the rarity also increasing chances for better items",
      "Veras can now roll SS tiers in the shop with a very small chance of 0.3% which is increased up to 2% with angelic Veras"
    ]
  },
  {
    "title": "Chaos Tower",
    "entries": [
      "Buffed No Escape debuff damage by 500%",
      "Removed collision from chaos turrets",
      "Clearing a chaos tower has a 50-100% chance depending on hell sub difficulty to drop a colosseum fragment. On inferno it awards you with 2 fragments."
    ]
  },
  {
    "title": "Chests",
    "entries": [
      "Buffed challenge dungeon chest MF from 2150 to 3350 on inferno and 2850 on hell and upgraded the chest rarity type from ancient to legion"
    ]
  },
  {
    "title": "Items",
    "entries": [
      "General",
      "Heroic drop rates are now 80% larger on their respected chase zones",
      "Journal now shows the chase drop rate for heroics",
      "Reaper´s Culling now only removes crit chance",
      "Tweaked item drop rates accross the board",
      "You can now prospect codex into a codex page and craft a new one with 5 pages.",
      "Added Faster Hit Recovery stat to various boots and shields.",
      "Removed Unbreakable tag",
      "Geras item prices increased by 120%",
      "Veras item prices decreased by 50%",
      "Merchant prices increased by 20%",
      "Fixed Summon Skills applying to sentries",
      "Fixed Flasks not being filtered correctly",
      "Cooldown reduction effectiveness reduced by 50% (due to spamming cooldown skills causing low fps and disconnections)",
      "Nerfed CDR stats on common items + charms",
      "Colosseum Fragments can be sold on market now",
      "Scroll of Ra can be sold on market now",
      "Overwhelming Power is now a passive skill",
      "Tier C satanics no longer drop below zone level 24",
      "Nerfed flat elemental skill damage on common items and charms.",
      "Nerfed crit damage affix on common items and charms.",
      "Added extra gold affix to small and medium charms"
    ]
  },
  {
    "title": "Augments / Incarnation",
    "entries": [
      "Nerfed Glyph of Loot from 1 per point to 0.5 per point.",
      "Fixed Monstrosity mana costs not updating after buff perishes."
    ]
  },
  {
    "title": "Socketables",
    "entries": [
      "Nerfed Wilrden Jewel life from 7% to 6%",
      "Buffed Lapis Lazuli critical chance from 3% to 5%",
      "Re-worked Tramal Jewel to give 2% all resists and 2% all damage reduction",
      "Buffed Mythgonlion Jewel fcr from 5% to 8%",
      "Nerfed Chaos Gem intelligence from 20 to 10.",
      "Added 7 strength and 7 dexterity to Moonstone Gem",
      "Buffed Sal Rune phys damage reduction from 3% to 4%",
      "Buffed Mal Rune magic damage reduction from 3% to 4%",
      "Buffed Um Rune all resist from 7% to 8%",
      "Buffed Zed Rune magic skill damage from 8% to 13%",
      "Buffed Nut Rune attack speed from 3% to 4%"
    ]
  },
  {
    "title": "New Items",
    "entries": [
      "Added Codex of Incarnation (Brute / Magister / Swiftness): Monster kills give you incarnation experience scaling with monster rarity.",
      "Added Codex of Rift (Treasure / Wisdom / Kobold / Gladiator): The Codex zone is now always an unstable rift dropping increased amounts of unstable dust",
      "Added Codex of Chaos (Doom / Doom / Heroism / Ancient): Chance to spawn chaos tower in the zone as an uber boss with its own unique drop pool of items",
      "Added Chaoswalkers (Unholy Boots)",
      "Added Thunder Roamers (Heroic Boots)",
      "Added Venom Roamers (Heroic Boots)",
      "Added Chilling Roamers (Heroic Boots)",
      "Added Scorching Roamers (Heroic Boots)",
      "Added Astral Roamers (Heroic Boots)",
      "Added Brutal Roamers (Heroic Boots)",
      "Added Pit Fighter´s Skullcracker [SS 1-Handed Set Mace]",
      "Added Pit Fighter´s Brutalizer [SS 1-Handed Set Mace]",
      "Added Pit Fighter´s Carnage [SS Set Ring]",
      "Added Pit Fighter´s Band Shirt [SS Set Body Armor]",
      "Added Pit Fighter´s Bone Crushers [SS Set Gloves]",
      "Added Metal Vocalist´s Warlock [SS 2-Handed Set Mace]",
      "Added Metal Vocalist´s Leather Face [SS Set Helmet]",
      "Added Metal Vocalist´s War Boots [SS Set Boots]",
      "Added Metal Vocalist´s Pentagram [SS Set Amulet]",
      "Added Metal Vocalist´s Fame [SS Set Ring]",
      "Added Scourge Loop [SS Ring]",
      "Added Dragon´s Eye [SS Amulet]",
      "Added Dragon Knight´s Vanguard [Unholy Body Armor]",
      "Added Dragon´s Heart [Unholy Charm]",
      "Added Dragon Knight´s Helmet [SS Helmet]",
      "Added Dragon´s Blessing [SS Ring]",
      "Added Signet of Kadosh [SS Heroic Amulet]",
      "Added Wizard´s Dice [SS Heroic Charm]",
      "Added Gladiator´s Dice [SS Heroic Charm]",
      "Added Bob´s Grenade [SS Set Charm]",
      "Added Fog [Runeword Body Armor]",
      "Added Chipped Diamond (Flat Physical Damage)",
      "Added Flawed Diamond (Flat Physical Damage)",
      "Added Diamond (Flat Physical Damage)",
      "Added Flawless Diamond (Flat Physical Damage)",
      "Added Perfect Diamond (Flat Physical Damage)",
      "Added Pristine Diamond (Flat Physical Damage)"
    ]
  },
  {
    "title": "Weapons",
    "entries": [
      "Buffed Deathquill",
      "Buffed Windforce",
      "Buffed Crow´s Whisper",
      "Buffed Spell Eater",
      "Nerfed Necrobutcher´s Curse",
      "Tweaked Thorn of Helheim",
      "Nerfed Flame of the Phoenix",
      "Nerfed Raise of the Dead",
      "Buffed St. Neri´s Rainbow Lance",
      "Buffed Hypothermia",
      "Buffed Dragon´s Breath",
      "Buffed Worm Claw",
      "Nerfed Glock 22 + lowered drop rate",
      "Buffed AK-47",
      "Tweaked/Nerfed Dawn Bringer",
      "Buffed and Re-worked Light of Dawn",
      "Nerfed Luci´s Day",
      "Buffed Sung Lee´s Destroyer Flail",
      "Buffed Shishkebab",
      "Tweaked/Buffed Rakhul´s Legion Crusher",
      "Buffed Blood of Abaddon",
      "Nerfed St. Nimo´s drop rate",
      "Buffed Crackling Thunder",
      "Buffed Pagan God´s Blasphemy",
      "Buffed Clafaxier",
      "Buffed Beacon of Shadows",
      "Buffed Mystical Wand of Manastream",
      "Buffed St. Houdeaniis Tiny Fire Rod",
      "Buffed The Oculus",
      "Buffed Scarred Battle Darts",
      "Slightly nerfed Sidewinder",
      "Re-worked Damien´s Corrupted Head",
      "Nerfed Skysong enhanced damage by 40%~",
      "Buffed Grief runeword"
    ]
  },
  {
    "title": "Belts",
    "entries": [
      "Buffed Set´s Lightning Sash",
      "Buffed Gladiator King´s Belt",
      "Buffed Belt of Skulls",
      "Buffed Soulburn Belt",
      "Buffed Freya´s Frozen Buckle"
    ]
  },
  {
    "title": "Body Armor",
    "entries": [
      "Changed Sheep King´s Hide to Inferno Only",
      "Changed Tactical Flak Jacket to \"Grenadier\" Set, SS tier."
    ]
  },
  {
    "title": "Helmet",
    "entries": [
      "Buffed Gaze of the Oblivion",
      "Buffed Grim Bone´s Visage",
      "Buffed Lava King´s Lost Mask",
      "Buffed Nikita´s KJ-33 Helmet",
      "Buffed Sight of the Gods",
      "Buffed Winged Crown of the North",
      "Buffed Sheep King´s Crown + changed to Inferno Only",
      "Buffed Butcher´s Hood",
      "Buffed Thunder Caller´s Veil"
    ]
  },
  {
    "title": "Rings",
    "entries": [
      "Buffed Stone of Jordan",
      "Buffed Sung Lee´s Unleashed Rage",
      "Buffed Signet of Harbringer",
      "Buffed Hellfire Halo",
      "Buffed Signet of Corruption",
      "Buffed Arcanis",
      "Buffed Stormloop",
      "Buffed Molten Band",
      "Buffed Dragonsteel Ring",
      "Buffed Khodo´s Wedding Band",
      "Buffed Iron Ring of Prometheus",
      "Buffed Elven´s Grace",
      "Buffed Tectonic Frequency",
      "Buffed Solar Prophet´s Signet",
      "Buffed Lunar Prophet´s Band",
      "Buffed and re-worked Absence of Constraint (A > SS tier)",
      "Buffed and re-worked Mark of Ferocity (A > S tier)",
      "Buffed and re-worked Sanguine Bloodstone (A > SS tier)",
      "Buffed Templar´s Faith",
      "Buffed Demon Eye Ring",
      "Buffed Satanic Eye",
      "Buffed Ra's Band",
      "Buffed Circle of Nature",
      "Buffed Merlocks Halo",
      "Buffed Ring of Tallus",
      "Buffed Viper´s Seal of Corrosion",
      "Buffed Astrope´s Signet of Blessing",
      "Buffed Apex Striker´s Ring"
    ]
  },
  {
    "title": "Gloves",
    "entries": [
      "Buffed Tectonic Grips",
      "Buffed Plague Bringer´s Touch",
      "Buffed Frostbitten Necrosis",
      "Buffed Shadow Occultist´s Wraps",
      "Buffed Brawler´s Fightning Mitts",
      "Nerfed Ali´s Boxing Gloves",
      "Buffed Rakhul´s Stone Hands",
      "Tweaked/Buffed Demonfire Accelerators",
      "Tweaked Grasp of Phoenix",
      "Buffed Zealot´s Deathbringers",
      "Buffed Bone Conjurer´s Grips"
    ]
  },
  {
    "title": "Amulets",
    "entries": [
      "Buffed Philosopher´s Stone",
      "Buffed and re-worked Thot´s Agony"
    ]
  },
  {
    "title": "Codex",
    "entries": [
      "Nerfed Codex of Goblin Horde from 3% to 1%"
    ]
  },
  {
    "title": "Common Items",
    "entries": [
      "Nerfed common charm flat physical damage gains."
    ]
  },
  {
    "title": "Other",
    "entries": [
      "Buffed the drop rate of Jussi´s Bong by 25%",
      "Buffed the drop rate of Colosseum Fragments by 30%",
      "Buffed the drop rate of Soul of Anguish from 20% to 35% > (40% on inferno)",
      "Buffed the drop rate of Soul of Corruption from 20% to 35% > (40% on inferno)",
      "Buffed the drop rate of Soul of Despair from 20% to 35% > (40% on inferno)",
      "Buffed the drop rate of Battle Fragments by 28%",
      "Buffed the drop rate of Dimensional by 37%",
      "Buffed the drop rate of Prime Evil Parts by 22% (Boss parts from act bosses)",
      "Buffed the drop rate of all angelic Runes by around 50%"
    ]
  },
  {
    "title": "Monsters",
    "entries": [
      "Nerfed gurag tower and bishop speed + color coded them",
      "Satan now spawns legion monsters instead of champions",
      "Increased the spawn speed of monsters in Unmarked Grave dungeon",
      "Fixed legion spawns in unstable rifts",
      "Increased Legion monster drop amount by 1 (Increased by 3 in Inferno)",
      "Increased Boss drop amount from 5-10 to 6-12",
      "Buffed Gabriel life by 33% and damage by 10%",
      "Chests now have a 0.5% chance to turn into a dangerous Mimic with built in loot amount and magic find on kill",
      "Buffed Act boss unique drop rates by 12% on Inferno",
      "Buffed Act boss loot amount by 3 on Inferno",
      "Fixed Odin storm break hitbox being too big",
      "Increased the life scaling curve of wormhole monsters",
      "Removed a few monster packs from Forgotten City dungeon",
      "Made Amun heart and all monsters knockback immune"
    ]
  },
  {
    "title": "Classes",
    "entries": [
      "Physical skills now show the total damage in tooltip",
      "Traveling chain lightning projectiles now execute their last hit properly",
      "Hit impact effects are now 2x faster",
      "Proc skill cooldowns are now their own list and dont interfere with the actual player skills cooldowns.",
      "Dual wielding 2 handed weapons nerfed, penalty increased from -35% attack speed to -40% attack speed",
      "Dual wielding 1 handed weapons buffed, changed flat +25% attack speed to total +10% attack speed.",
      "Improved Charge and Leap skills looping projectile/effects"
    ]
  },
  {
    "title": "Viking",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Whirlwind - Base AOE buffed 60%.",
      "Whilrwind - Typhoon: Nerfed area of effect from 15% to 10% per point.",
      "Whirlwind: Buffed attack damage scaling from 10% to 13.5% per point.",
      "Whirlwind - Burning Air: Re-worked: Chance on hit to inflict burning based on your total attack speed. (15% conversion + 4% proc chance per point).",
      "Whirlwind - Trail of Fire: Added area of effect scaling to the node for flame size (20% per point). This node will also benefit from the proc Burning Air.",
      "Whirlwind - Trail of Fire: Now applies extra damage to burning targets node.",
      "Whirlwind - Sharpened Blades: Fixed the skill, now dealing correct damage.",
      "Whirlwind - Detonation: Now procs automatically every 6 seconds of casting whirlwind resetting the gathered damage.",
      "Whirlwind - Negative Pressure: Added 20% armor break per point.",
      "Whirlwind - Cycloning Step: Buffed movement speed scaling from 7% to 10% per point.",
      "Whirlwind - Airborne Debris: Nerfed max points from 5 to 2.",
      "Monster Throw - Breaking Fall: Buffed arcane break from 5% to 15% per point.",
      "Monster Throw - Vacuum Pitch: Added 25% damage scaling to the node.",
      "Monster Throw - Dimensional Pitch: Buffed damage scaling from 25% to 40% per point.",
      "Monster Throw - Echoing Throw: Buffed damage from 18% to 25% per point.",
      "Charge - Body Slam: Buffed damage to stunned from 10% to 20% per point.",
      "Charge - Overconfidence: Buffed area of effect scaling from 15% to 17.5% per point.",
      "Charge - Spirit Breaked: Buffed arcane break from 10% to 30% per point but added a 4% proc chance to the node.",
      "Charge - Crushing Impact: Buffed critical damage from 25% to 35% per point.",
      "Charge - Forceful Grab: Buffed damage scaling from 20% to 30% per point.",
      "Charge - Crashquake: Buffed damage scaling from 35% to 45% per point.",
      "Charge - Mountain Fall: Buffed damage scaling from 25% to 35% per point.",
      "Odin´s Fury - Tormenting Shout: Buffed scaling from 0.25% to 0.425% per point.",
      "Odin´s Fury - Warcry: Buffed damage scaling from 20% to 35% per point.",
      "Odin´s Fury - Pulsing Echo: Buffed damage scaling from 5% to 20% per point.",
      "Odin´s Fury - Trembling Roar: Buffed damage to burning and bleeding from 20% to 30% per point.",
      "Seismic Slam - Lethal Crush: Buffed critical damage from 10% to 20% per point.",
      "Seismic Slam - Cheap Slam: Buffed damage to stunned from 5% to 15% per point.",
      "Seismic Slam - Seismic Aftershock: Buffed proc chance from 3% to 4% per point.",
      "Seismic Slam - Earth Root: Buffed damage scaling from 25% to 40% per point.",
      "Seismic Slam - Shattered Earth: Buffed damage scaling from 12% to 30% per point.",
      "Seismic Slam - Echoing Slam: Buffed damage scaling from 15% to 35% per point.",
      "Seismic Slam - Seismic Crack: Buffed damage scaling from 10% to 50% per point.",
      "Seismic Slam - Younger Dryas: Buffed damage scaling from 50% to 75% per point.",
      "Seismic Slam - Polar Shift: Increased leap distance",
      "Seismic Slam - Polar Shift: No longer has cooldown",
      "Seismic Slam - Younger Dryas: Can now crit + lowered cooldown from 2 seconds to 1.5 seconds.",
      "Shockwave - Ground Fissure: Buffed damage scaling from 10% to 30% per point.",
      "Shockwave - Shocking Crust: Buffed critical damage from 10% to 20% per point.",
      "Shockwave - Multi Trail: Buffed damage scaling from 25% to 35% per point.",
      "Shockwave - Cracked Earth: Buffed armor break from 8% to 25% per point.",
      "Shockwave - Meteorology: Buffed damage from 25% to 40% per point.",
      "Shockwave - Duck and Cover: Buffed damage to stunned from 8% to 12.5% per point.",
      "Shockwave - Trembling Trail: buffed damage scaling from 20% to 30% per point.",
      "Shockwave - Forking Crust: Buffed damage scaling from 35% to 45% per point.",
      "Shockwave - Earthen Maelstrom: Buffed damage scaling from 25% to 35% per point.",
      "Shockwave - Cataclysmic Smash: Buffed damage scaling from 45% to 125% per point. Removed shotgunning."
    ]
  },
  {
    "title": "Marksman",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Arrow Rain - Kill Command: Fixed tooltip showing % + added 15% damage scaling to the node.",
      "Arrow Rain - Contract Killer: Now unleashes the same amount of projectiles as the normal node increasing damage dealt.",
      "Arrow Rain - Scorching Volley: Re-worked to inflict burning with increased frequency.",
      "Arrow Rain: Fixed some modifiers not working correctly.",
      "Arrow Rain - Arrow Splinter: Added a 4 second cooldown to this node.",
      "Trickshot - Splitting Trickshot: Added 15% damage scaling to the node.",
      "Trickshot - Splitting Trickshot: Fixed skill not inheriting modifiers correctly.",
      "Trickshot - Deadly Accuracy: Buffed critical damage from 10% to 20% per point.",
      "Trickshot - Maiming Shot: Buffed bleed damage from 12% to 35% per point but added a 4% per point proc chance.",
      "Trickshot - Power Shot: Buffed damage scaling from 25% to 35% per point.",
      "Volatile Shot: Fixed the explosion not applying modifiers to enemies.",
      "Arrow Rampage - Fiery Rain of Arrows: Removed fire damage conversion and replaced with regular damage scaling.",
      "Frag Grenade: Increased the gravity force for shrapnel, lowering traveled distance.",
      "Frag Grenade - Fragging Penetration: Buffed arcane break from 8% to 30% per point but added a 4% proc chance to the node.",
      "Frag Grenade - Incendiery Grenade: Buffed burning damage from 15% to 35% per point but added a 4% proc chance to the node.",
      "Frag Grenade - Smell of Burning: Buffed damage to burning from 10% to 20% per point.",
      "Frag Grenade - Grenadier: Added 25% damage scaling to the node but nerfed projectiles from 3 to 2 per point.",
      "Rocket Turret - Boombox: Fixed the node, now works correctly.",
      "Rocket Turret - Colossal Shot: Now pierces properly.",
      "Rocket Turret - Cyclone Turret: No longer divides damage between projectiles.",
      "Gunner Drones - CYCLOPS: Now inherits sub node effects.",
      "Gunner Drones - Burning Shot: Buffed burning damage from 15% to 25% per point."
    ]
  },
  {
    "title": "Pirate",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Parrot: Parrots now ignore voids/water/gaps/holes and fly over.",
      "Grenade Jump: Increased jump range from 240px to 380px. Jumping with this skill has removed landing diminish.",
      "Buckshot: Trail animation is now faster",
      "Buckshot - Spiced Up: Buffed burning damage from 15% to 30% per point but added proc chance.",
      "Buckshot - Scorched Slugshot: Increased extra damage to burning from 10% to 20% per point.",
      "Buckshot - One Slug to End them All: Buffed damage scaling from 40% to 70% per point.",
      "Buckshot - Circle of Slugs: Added 15% damage scaling to the node.",
      "Buckshot - Slick Slugs: Buffed damage scaling from 38% to 65% per point.",
      "Explosive Barrel - Inflammable Liquidd: Buffed extra damage to burning from 10% to 20% per point.",
      "Explosive Barrel - Scatter Barrel: Buffed proc chance from 3% to 4% per point.",
      "Explosive Barrel - Sudden Dynamite: Buffed damage scaling from 8% to 20% and proc chance from 3% to 4% per point.",
      "Explosive Barrel - Incendiary Explosives: Buffed burning damage from 15% to 22.5% per point.",
      "Explosive Barrel - Bring The Grog: Buffed damage scaling from 30% to 60% per point.",
      "Explosive Barrel - Field of Explosives: Added 20% damage scaling to the node.",
      "Cannonball - Blast The Horizon: Buffed damage scaling from 25% to 45% per point.",
      "Cannonball - Mega Shot: Buffed damage scaling from 60% to 75% per point.",
      "Cannonball - Rolling Balls: Buffed damage scaling from 40% to 50% and burning damage from 50% to 75% per point.",
      "Explosive Bullet - Grouping Up: Buffed proc chance from 3% to 5% per point.",
      "Explosive Bullet - Shattering Blast: Buffed armor break from 10% to 15% per point.",
      "Explosive Bullet - Sudden Scatter: Buffed proc chance from 3% to 4% per point.",
      "Explosive Bullet - Boss Killer: Buffed damage to bosses from 15% to 20% per point.",
      "Explosive Bullet - Napalm Infusion: Buffed burning damage scaling from 15% to 30% and proc chance from 3% to 4% per point.",
      "Explosive Bullet - Gasoline: Buffed extra damage to burning from 10% to 20% per point.",
      "Explosive Bullet - Shotwave: Buffed damage scaling from 20% to 40% per point.",
      "Explosive Bullet - Chain Reaction: Added 15% damage scaling to the node.",
      "Explosive Bullet - Penetrating Trail: Buffed damage scaling from 10% to 25% per point.",
      "Powder Trail: Added a 2.5 second cooldown to the skill.",
      "Powder Trail: Buffed damage scaling from 10.5 to 18.5 per point.",
      "Powder Trail - Napalm Powder: Buffed burning damage from 15% to 20% per point.",
      "Powder Trail - Blowing Up: Buffed damage scaling from 8% to 10% per point.",
      "Powder Trail - Heated Powder: Buffed extra damage to burning from 10% to 15% per point.",
      "Powder Trail - Powder Detonation: Buffed damage scaling from 8% to 20% per point.",
      "Powder Trail - Dual Barrel: Buffed proc chance from 3% to 4% per point.",
      "Powder Trail - Barrel of Barrels: Added 15% damage scaling to the node.",
      "Powder Trail - Flaming Barrels: Buffed damage scaling from 35% to 60% per point.",
      "Torrent - Splash Impact: Buffed proc chance from 3% to 4% per point.",
      "Torrent - Watery Fissure: Buffed damage scaling from 15% to 30% and proc chance from 3% to 4% per point.",
      "Torrent - Subzero Liquid: Buffed cold break from 10% to 30% and proc chance from 3% to 4% per point.",
      "Torrent - Water Mass: Buffed damage scaling from 8% to 10% per point.",
      "Torrent - Hypothermic Liquid: Buffed extra damage to frozen from 10% to 15% per point.",
      "Torrent - Chaotic Wave: Buffed damage scaling from 35% to 50% per point.",
      "Torrent - Whirl Pool: Buffed damage scaling from 50% to 65% per point.",
      "Torrent - Storm Pillar: Buffed damage scaling from 75% to 100% per point.",
      "Anchor Swing - Sharpened Bill: Buffed damage scaling from 8% to 10% per point.",
      "Anchor Swing - Extended Weight: Buffed damage scaling from 15% to 30% per point.",
      "Anchor Swing - Anchoring the Anchor: Buffed damage scaling from 35% to 50% per point.",
      "Bomb Barrage: Bombs now explode when colliding with monsters.",
      "Bomb Barrage - Sharp Scatter: Buffed damage from 10% to 25% and proc chance from 3% to 4% per point."
    ]
  },
  {
    "title": "Pyromancer",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Breath of Fire - Hydra´s Breeze: Added 15% increased damage scaling to the node.",
      "Breath of Fire - Chain of Fire: Added 25% increased damage scaling to the node.",
      "Breath of Fire - Molten Orb: Added 30% increased damage scaling to the node.",
      "Hydra - Scorching Kraken: Added 15% damage conversion per max amount of hydras to the damage multiplier. Nerfed damage scaling from 75% to 40%.",
      "Hydra - More Heads More Fire: Added a 3 second cooldown when using this node.",
      "Hydra - Increased fireballs projectile speed",
      "Blazing Trail - Crackling Heat: Now each individual flame procs crackling heat instead of the proc being for the whole cast.",
      "Armageddon - Warped Doom: Now procs the smaller nodes properly",
      "Armageddon - Blazing Pulse: Now works correctly",
      "Comet: Increased falling speed.",
      "Blazing Trail - Burning Veins: Buffed fire break from 6% to 15% per point.",
      "Blazing Trail - Forking Flames: Buffed damage from 35% to 45% per point.",
      "Blazing Trail - Circle of Fire: Buffed damage scaling from 20% to 30% per point.",
      "Blazing Trail - Trail of Comets: Buffed damage scaling from 50% to 75% per point.",
      "Fire Ball - Gas Fumes: Buffed burning damage from 15% to 30% per point.",
      "Fire Ball - Paralyzing Impact: Buffed damage scaling from 15% to 35% per point.",
      "Fire Ball - Soul Burn: Buffed fire break from 6% to 15% per point.",
      "Fire Ball - Mark of Doom: Buffed damage scaling from 15% to 30% per point.",
      "Fire Ball - Split Fire: Added 15% damage scaling to the node.",
      "Fire Ball - Path of Destruction: Buffed damage scaling from 15% to 35% per point.",
      "Comet - Comet Fragment: Buffed proc chance from 3% to 4% per point.",
      "Comet - Molten Aftershock: Buffed damage scaling from 15% to 35% per point.",
      "Comet - Shattering Impact: Buffed fire break from 5% to 10% per point.",
      "Comet - Stunning Hit: Nerfed proc chance from 8% to 5% per point.",
      "Comet - Cracked Terrain: Buffed damage to stunned from 10% to 20% per point.",
      "Comet - Flaming Terrain: Buffed damage scaling from 15% to 35% per point."
    ]
  },
  {
    "title": "Nomad",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Sand Carver - Concentrated Sand: Buffed damage scaling from 8% to 10% per point.",
      "Sand Carver - Combat Skills: Buffed dodge chance from 10% to 15% per point.",
      "Sand Carver - Swift Strikes: Buffed attack speed scaling from 6% to 8% per point.",
      "Sand Carver - Sand Infusion: Buffed break scaling from 8% to 15% per point.",
      "Sand Carver - Sand Infusion: Buffed proc chance from 3% to 4% per point.",
      "Sand Carver - Eviscerate: Buffed damage scaling from 30% to 40% per point.",
      "Sand Gush - Sand Tornado: Buffed damage scaling from 15% to 45% per point.",
      "Sand Gush - Overwhelming Sand: Buffed bleed damage from 15% to 25% per point.",
      "Sand Gush - Overwhelming Sand: Buffed proc chance from 3% to 4% per point.",
      "Sand Gush - Sandstorm: Fixed bleed not working properly",
      "Sand Gush: Added 1 additional base tornado.",
      "Flying Scimitar: Base movement diminish buffed from 65% to 85%.",
      "Flying Scimitar - Slice and Flight: Buffed projectile speed from 5% to 7% per point.",
      "Flying Scimitar - Salted Blade: Buffed damage to bleeding from 10% to 15% per point.",
      "Flying Scimitar - Flying Swarm: Buffed damage scaling from 25% to 40% per point.",
      "Flying Scimitar - Sticking Blade: Buffed damage scaling from 20% to 37.5% per point.",
      "Flying Scimitar - League of Nomad: Buffed damage scaling from 5% to 7% per point.",
      "Flying Scimitar - Orbital Blade Strike: Buffed damage scaling from 20% to 50% per point.",
      "Sand Tremors - Shrouding Sand: Fixed indicator being different size than the actual hitbox",
      "Cloud of Sand - Desert´s Echo: Added missing damage scaling.",
      "Sand Vortex - Stuttering Pull: Now procs per individual monster being hit by the vortex.",
      "Sand Vortex - Sunken Field: Increased padding so the vortexes no longer overlap.",
      "Eye of Ra - Heat Paralysis: Now inflicts elemental break instead of fire break, nerfed from 15% to 10% per point.",
      "Scimitar Charge - Phantom Charge: Fixed the skill being too loud.",
      "Phantom Blade: Increased base hitbox size by 50%",
      "Chainslice - Ghost Blade: Buffed damage scaling from 15% to 50% per point.",
      "Chainslice - Critical Shred: Buffed damage scaling from 20% to 40% per point.",
      "Chainslice - Blood Burn: Buffed damage scaling from 35% to 75% per point.",
      "Chainslice - Chainception: Added 15% damage scaling to the node.",
      "Phantom Blade - Terrorized Mind: Buffed damage scaling from 45% to 60% per point.",
      "Phantom Blade - Spirit Blades: Buffed damage scaling from 60% to 100% per point.",
      "Phantom Blade - Spectral Ghost Blade: Buffed conversion from 3% to 4% per point.",
      "Phantom Blade - Dimensional Ghost Blade: Added 20% damage scaling to the node.",
      "Oasis Aura: Now also provides 2% arcane skill damage per point."
    ]
  },
  {
    "title": "Redneck",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Oil & Flames: Oil now extends existing flames duration rather than creates an overlapping one, due to FPS issues.",
      "Moonshine Molotov - Scorching Collision: Buffed fire break from 10% to 17.5% per point.",
      "Moonshine Molotov - Gas Leak: Buffed damage from 20% to 35% per point.",
      "Moonshine Molotov - Burn The Demons: Buffed burning damage from 10% to 20% per point.",
      "Moonshine Molotov - Blazing Trail of Flames: Added 20% damage scaling to the node.",
      "Pipe Bombs - Blasting Powder: Buffed damage scaling from 8% to 10% per point.",
      "Pipe Bombs - Upwards Pressure: Buffed damage scaling from 25% to 40% per point.",
      "Tire Fire - Increased Stock: Buffed projectile speed from 10% to 12.5% per point.",
      "Tire Fire - Flaming Tire: Buffed burning damage from 15% to 22.5% per point.",
      "Tire Fire - Mini Tires: Added 20% damage scaling to the node.",
      "Tire Fire - Donuts: Buffed damage scaling from 25% to 50% per point.",
      "Tire Fire - Loose Tire: Buffed damage scaling from 50% to 75% per point.",
      "Pickup Raid - Speed Dial: Nerfed cooldown reduction from 10% to 7% per point.",
      "Pickup Raid: Nerfed projectile lifetime from 2 seconds to 1.25 seconds.",
      "Tree Trunk Triumph - Splinters: Buffed bleed damage from 15% to 30% per point.",
      "Tree Trunk Triumph - Tree Fall: Buffed proc chance from 3% to 4% per point.",
      "Tree Trunk Triumph - Heavy Trunk: Buffed damage to stunned from 10% to 20% per point.",
      "Tree Trunk Triumph - Sticking Splinters: Buffed damage from 15% to 30% per point.",
      "Tree Trunk Triumph - Sudden Tree Fall: Buffed proc chance from 3% to 4% per point.",
      "Tree Trunk Triumph - Maiming Collision: Buffed arcane break from 10% to 15% per point.",
      "Tree Trunk Triumph - Splitting Fall: Buffed damage scaling from 15% to 30% per point.",
      "Tree Trunk Triumph - Stack of Trunks: Added 15% damage scaling to the node."
    ]
  },
  {
    "title": "Necromancer",
    "entries": [
      "Removed the cooldown from all summon skills.",
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Raise Skeleton Mage - Undead Coven: Max points set from 5 to 3.",
      "Raise Skeleton Mage - Unholy Force: Buffed damage scaling from 8% to 15% per point.",
      "Skeleton Mastery: Nerfed damage scaling from 2.5% to 2% and life scaling from 4% to 3.5% per point.",
      "Summon Frenzy: Nerfed attack speed scaling from 2.5% to 2% per point.",
      "Summon Vengeful Spirit: Nerfed damage scaling from 7.25 to 6.75 per point.",
      "Summon Vengeful Spirit - Retaliatory Transfusion: Changed to scale from vengeful spirits damage rather than monster max life.",
      "Summon Skeleton Warrior: Nerfed damage scaling from 2.75 to 2.5 per point.",
      "Summon Resistances: Nerfed resistance scaling from 3% to 2% and damage taken from 1.25% to 0.75% per point.",
      "Summon Damned Legion - Crimson Aura: Nerfed damage scaling from 35% to 22.5% per point.",
      "Bone Spear: Buffed intelligence scaling from 7.25% to 8.75% per point.",
      "Bone Spear: Buffed damage scaling from 12.5 to 14.25 per point.",
      "Bone Spear - Spiritual Tradeoff: Buffed conversion to 2% of your energy as damage, fixed the description and changed mana cost to -5% from max mana per point.",
      "Bone Spear - Autoimmune Disease: Fixed to arcane break and now works properly",
      "Bone Spear - Raising Spirits: Buffed proc chance from 3% to 4% per point.",
      "Bone Spear - Bone Density: Buffed damage scaling from 8% to 10% per point.",
      "Bone Spear - Disease Ridden Bone: Buffed poisoned damage scaling from 15% to 40% per point.",
      "Bone Spear - Sharp Edged Bone: Buffed critical damage from 15% to 35% but nerfed chance from 7% to 5% per point.",
      "Bone Spear - Bone Conjuring: Buffed movement diminish from 10% to 20% per point.",
      "Bone Spear - Fervoring Fever: Buffed damage to poisoned from 10% to 20% per point.",
      "Bone Spear - Plenty of Bone: Added 15% damage scaling to the node.",
      "Bone Spear - Plenty of Bone: Now bounces off of walls",
      "Bone Spear - Bone Splinters: Added 25% damage scaling to the node.",
      "Bone Shred: Buffed intelligence scaling from 7.35% to 8.15% per point.",
      "Bone Shred: Buffed damage scaling from 7.25 to 8.35 per point.",
      "Bone Shred - Osteochondroma: Buffed damage scaling from 10% to 30% per point.",
      "Bone Shred - Quick Growth: Buffed faster cast rate from 6% to 8% per point.",
      "Bone Shred - Exposed Fracture: Buffed bleed damage from 15% to 35% per point.",
      "Bone Shred - Infected Wound: Buffed damage to bleeding from 10% to 15% per point.",
      "Bone Shred - Bone Spurs: Buffed proc chance from 3% to 4% per point.",
      "Bone Shred - Bomb of Bones: Added 20% damage scaling to the node.",
      "Bone Shred - Shattering Carcass: Added 15% damage scaling to the node.",
      "Bone Shred - Skeletal Split: Buffed damage scaling from 10% to 20% per point.",
      "Meat Bomb: Buffed intelligence scaling from 7.5% to 8% per point.",
      "Meat Bomb: Buffed damage scaling from 11.25 to 13.5 per point.",
      "Bone Spirit: Buffed intelligence scaling from 7.15% to 7.75% per point.",
      "Bone Spirit: Removed cooldown",
      "Bone Spirit: Nerfed damage from 27.5 to 8.75 per point.",
      "Bone Spirit - Purifying Essence: Buffed damage scaling from 8% to 10% per point.",
      "Bone Spirit - Ancient Possession: Now adds a flat predetermined amount of damage per scale.",
      "Bone Spirit - Cycle of Life: Changed into spell crit chance + spell crit chance.",
      "Bone Spirit - Touch of Arcana: Buffed arcane break from 10% to 15% per point."
    ]
  },
  {
    "title": "Samurai",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Explosive Kunai - Ronin´s Curse: Buffed arcane break from 10% to 35% per point.",
      "Explosive Kunai - Double Blast: Buffed proc chance from 3% to 4% per point.",
      "Explosive Kunai - Bouncy Kunai: Buffed proc chance from 3% to 4% per point.",
      "Explosive Kunai - Concussive Explosions: Buffed damage to stunned from 10% to 20% per point.",
      "Explosive Kunai - Penetrating Volley: Added 15% damage scaling to the node.",
      "Explosive Kunai - Chainsplosions: Added 25% damage scaling to the node.",
      "Explosive Kunai - Little Slicers: Buffed bleed damage from 35% to 50% per point.",
      "Battle Glance - Spinning Katanas: Buffed bleed damage from 10% to 30% per point.",
      "Blade Barrier - Spinning Armory: Added a -10% damage per point scaling to the node.",
      "Blade Barrier - Infinite Potential: Changed max points from 5 to 4.",
      "Blade Barrier - Damascus Steel Blades: Nerfed attack damage from 15% to 12.5% per point.",
      "Blade Barrier - Nerfed attack damage scaling from 12% to 11% per point and nerfed the phys synergy scaling."
    ]
  },
  {
    "title": "Omnislash: Nerfed attack damage scaling from 25% to 22% per point.",
    "entries": [
      "Omnislash - Extra Cut: Changed swings from 2 per point to 2 + (1 per point).",
      "Omnislash - No Hesitation: Nerfed cooldown reduction from 8% to 7% per point.",
      "Omnislash - Looming Cover: Nerfed duration from 20% to 15% per point.",
      "Omnislash - Nail In The Coffin: Nerfed damage from 15% to 12.5% per point.",
      "Omnislash - Emperor´s Orders: Buffed proc chance from 3% to 4% per point.",
      "Paladin",
      "Vengeance - Higher Frequency: Buffed attack speed scaling from 6% to 8% per point.",
      "Vengeance - Amped Amps: Buffed lightning damage scaling from 10% to 15% per point.",
      "Vengeance - Power Surge: Buffed attack damage scaling from 10% to 15% per point.",
      "Vengeance - Copper Plated Blade Edge: Change from attack rating to spell critical chance and damage.",
      "Vengeance - Destructive Voltage: Buffed lightning break from 10% to 25% per point.",
      "Vengeance - Alternative Current: Buffed damage scaling from 12% to 35% per point.",
      "Vengeance - Self Shock: Buffed conversion from 5% to 6% per point.",
      "Divine Storm - Charged Cells: Buffed stasis damage from 15% to 30% per point.",
      "Divine Storm - Divine Ionization: Buffed lightning break scaling from 15% to 25% per point.",
      "Divine Storm - Voltage Charge: Buffed damage return from 15% to 40% per point.",
      "Divine Storm - Electron Jump: Buffed defense scaling from 15% to 25% and proc chance from 3% to 4% per point.",
      "Divine Storm - Heaven´s Interference: Buffed proc chance from 3% to 4% per point.",
      "Divine Storm - Blow The Fuse: Buffed damage scaling from 15% to 35% per point.",
      "Divine Storm - Precision of the Storm: Fixed tooltip and buffed damage scaling from 6% to 10% per point.",
      "Divine Storm - Eye of the Storm: Buffed lightning break from 20% to 30% per point.",
      "Divine Storm - Bad Omens: Buffed damage scaling from 35% to 50% per point.",
      "Holy Shock Aura - Adjusted Fuses: Buffed damage scaling from 15% to 35% per point.",
      "Holy Shock Aura - Rupturing Lightning: Buffed lightning break from 15% to 30% per point.",
      "Holy Shock Aura - Concentrated Aura: Buffed damage scaling from 8% to 12.5% per point.",
      "Holy Shock Aura - Charge Mark: Buffed stasis damage from 15% to 35% per point.",
      "Holy Shock Aura - Double The Hz: Changed from 5% to 6% + (2% per point).",
      "Holy Shock Aura - Lightning Tether: Buffed damage from 20% to 50% per point.",
      "Holy Shock Aura - Gathering Storm: Buffed damage from 12.5% to 15% per point.",
      "Lightning Fury - Crackling Thunder: Buffed lightning break from 15% to 35% per point.",
      "Lightning Fury - Breaking Soundbarrier: Buffed proc chance from 3% to 4% per point.",
      "Lightning Fury - Electro Pulse: Buffed proc chance from 3% to 4% per point.",
      "Lightning Fury - Forking Bolts: Buffed proc chance from 3% to 4% per point.",
      "Lightning Fury - Maximize Fury: Buffed critical damage from 18.5% to 25% per point.",
      "Lightning Fury - Storm Surge: Buffed damage scaling from 12% to 20% per point.",
      "Lightning Fury - Concentrated Fury: Buffed damage scaling from 30% to 45% per point.",
      "Fist of the Heavens - One With the Faith: Changed from 2 projectiles per point to 3 + (1 projectile per point)",
      "Holy Bolt - Lightforce: Buffed damage scaling from 30% to 40% per point.",
      "Holy Bolt - Call of Justice: Buffed damage scaling from 30% to 40% and proc chance from 3% to 4% per point.",
      "Holy Bolt - Touch of Righteousness: Nerfed healing from 2.5% to 0.5% per point (+ fixed tooltip)",
      "Holy Hammer - Blessed Light: Buffed damage scaling from 8% to 10% per point.",
      "Holy Hammer - Thor´s Revenge: Buffed damage scaling from 20% to 30% and proc chance from 3% to 4% per point.",
      "Holy Hammer - Slamming Mallet: Buffed damage scaling from 30% to 40% per point.",
      "Holy Hammer - Divine Lightning: Buffed damage scaling from 35% to 45% per point.",
      "Holy Hammer - Returning Lightforge: Buffed damage scaling from 40% to 60% per point.",
      "Holy Hammer - Orbital Light: Buffed damage scaling from 30% to 35% per point.",
      "Holy Hammer - Chaining Mallet: Buffed damage scaling from 15% to 25% per point."
    ]
  },
  {
    "title": "Amazon",
    "entries": [
      "Thunder Fury - Leaping Thunder: now inherits critical chance and critical damage",
      "Thunder Fury - Leaping Thunder: Buffed damage scaling from 15% to 30% per point.",
      "Thunder Fury - Arc Lightning: Added 25% damage scaling to the node.",
      "Thunder Fury - Vacuuming Thunder: Buffed damage scaling from 35% to 45% per point.",
      "Thunder Fury - Electric Essence: Buffed stasis damage from 45% to 75% per point.",
      "Storm Dash: Increased base range from 180px to 260px",
      "Storm Dash: Now scales off of attack speed.",
      "Storm Dash - Lightning Trail: Fixed a multiplier bug in the electrified effect.",
      "Envenom: Burst animation is now faster",
      "Caustic Spearheads: Poison Gas animation is now faster",
      "Astrope´s Gift - Power Current: Buffed damage scaling from 8% to 10% per point.",
      "Astrope´s Gift - Astrope´s Curse: Buffed lightning break scaling from 15% to 25% and proc chance from 3% to 4% per point.",
      "Astrope´s Gift - Astrope´s Revenge: Buffed proc chance from 3% to 4% per point.",
      "Astrope´s Gift - Ending Fate: Buffed boss damage from 10% to 20% per point.",
      "Astrope´s Gift - Zapping Voltage: Buffed stasis damage from 18% to 30% and proc chance from 3% to 4% per point.",
      "Astrope´s Gift - Surging Stormbolt: Buffed damage scaling from 35% to 60% per point.",
      "Astrope´s Gift - Thundering Storm: Buffed damage scaling from 30% to 45% per point.",
      "Rebound - Splitting Speartip: Buffed proc chance from 3% to 4% per point.",
      "Rebound - Multi Rebound: Lowered the damage penalty from -15% to -7% per point.",
      "Rebound - Increasing Odds: Buffed critical damage scaling from 15% to 25% per point.",
      "Rebound - Penetrating Rebound: Buffed lightning break scaling from 15% to 25% per point.",
      "Rebound - Electro Charged Rebound: Buffed damage from 35% to 65% per point.",
      "Rebound - Orbital Rebound: Buffed damage scaling from 60% to 100% per point.",
      "Rebound - Kickback Projectile: Buffed damage scaling from 25% to 40% per point.",
      "Spearnage - Lethal Spear Storm: Buffed damage scaling from 8% to 10% per point.",
      "Spearnage - Accurate Spearing: Buffed attack rating scaling from 1% to 10% per point.",
      "Spearnage - Thunder Tips: Buffed lightning damage scaling from 10% to 17.5% per point.",
      "Spearnage - Pointy Ends: Buffed armor break from 15% to 30% per point.",
      "Spearnage - Conqueror of Light: Buffed boss damage from 10% to 20% per point."
    ]
  },
  {
    "title": "Demon Slayer",
    "entries": [
      "Trigger Finger - Finger Tapped Killshot: Added 20% damage scaling to the node.",
      "Trigger Finger - Its Raining Bullets: Added 30% damage scaling to the node.",
      "Trigger Finger - Its Raining Bullets: Buffed bullet hitbox size by 2x",
      "Trigger Finger - Shredder Slugs: Added 30% damage scaling to the node + buffed bleed damage from 40% to 60% per point.",
      "Bullet Hell - Hellflame Bullets: Buffed damage scaling from 8% to 10% per point.",
      "Bullet Hell - More Bullets: Buffed projectiles from 1 per point to 2 + (1 per point).",
      "Bullet Hell - Slipping Trigger Finger: Buffed proc chance from 3% to 4% per point.",
      "Bullet Hell - Heavy Bullet Impact: Buffed proc chance from 3% to 4% per point.",
      "Bullet Hell - Blasting Gunshot: Buffed critical damage from 15% to 22.5% per point.",
      "Bullet Hell - Fragging Rounds: Buffed proc chance from 3% to 4% per point.",
      "Bullet Hell - Abusive Tactics: Buffed damage to stunned from 10% to 20% per point.",
      "Bullet Hell - Gun Powder: Buffed damage scaling from 40% to 75% per point.",
      "Bullet Hell - Bullet Storm: Re-worked the skill, now shoots a traveling circle of bullets with shotgunning",
      "Bullet Hell - Bullet Storm: Added 10% damage scaling to the node.",
      "Bullet Hell - Nowhere To Hide: Added 15% damage scaling to the node.",
      "Bullet Hell - Demon´s Ricochet: Added 25% damage scaling to the node.",
      "Possessed Bullet - Hemorrhaging Possession: Buffed bleed damage from 15% to 30% and proc chance from 3% to 4% per point.",
      "Possessed Bullet - Blood Ripples: Buffed proc chance from 3% to 4% per point.",
      "Possessed Bullet - Bloodlusted Bullets: Buffed damage to bleeding from 10% to 20% per point.",
      "Possessed Bullet - Stop Resisting: Buffed armor break from 10% to 15% per point.",
      "Possessed Bullet - Ghost Whirl: Added 25% damage scaling to the node.",
      "Possessed Bullet - Seeking Host: Buffed damage scaling from 25% to 50% per point.",
      "Possessed Bullet - Haunting: Buffed damage scaling from 25% to 40% per point.",
      "Possessed Bullet - Malignance: Buffed damage scaling from 20% to 30% per point.",
      "Fast Slices - Slashing Strike: Buffed damage scaling from 8% to 10% per point.",
      "Fast Slices - Expert Slayer: Added 4% critical chance per point to the node.",
      "Fast Slices - Demon´s Heart: Buffed damage from 25% to 40% and proc chance from 3% to 4% per point.",
      "Fast Slices - Ferocious Slice: Buffed damage from 20% to 40% and proc chance from 3% to 4% per point.",
      "Fast Slices - Burning Blade: Buffed burning damage from 15% to 30% and proc chance from 3% to 4% per point.",
      "Fast Slices - Molten Steel: Buffed damage to burning from 10% to 20% per point.",
      "Fast Slices - Swift Deadstrike: Buffed critical damage from 15% to 22.5% per point.",
      "Fast Slices - Demon Slaying: Buffed execution from 1% to 1.25% per point.",
      "Fast Slices - Flaming Blades: Buffed burning damage from 40% to 75% and damage scaling from 20% to 40% per point.",
      "Fast Slices - Detonating Slice: Buffed damage scaling from 15% to 30% per point.",
      "Fast Slices - Shadow Daggers: Added 40% damage scaling per point to the node + change projectiles from 4 per point to 3 + (1 per point).",
      "Slice of Shadows - Crushing Veil: Buffed armor break from 15% to 25% and proc chance from 3% to 4% per point.",
      "Slice of Shadows - Cold Shadow: Buffed proc chance from 3% to 4% per point.",
      "Slice of Shadows - Frostbitten Mist: Buffed damage to frozen from 10% to 20% per point.",
      "Slice of Shadows - Lingering Shadows: Buffed damage scaling from 10% to 15% per point.",
      "Slice of Shadows - Lingering Shadows: Reduced stack requirement from 35 to 20.",
      "Slice of Shadows - Scorching Shadow: Buffed burning damage from 35% to 75% per point.",
      "Slice of Shadows - Scorching Shadow: Added 1 projectile per point to the node.",
      "Slice of Shadows - Bitter Smoke: Buffed critical damage from 3% to 10% per point.",
      "Slice of Shadows - Shadow Extraction: Buffed damage scaling from 20% to 50% per point.",
      "Slice of Shadows - Shadow Extraction: Lowered the cooldown from 3 seconds to 1 second.",
      "Demon´s Presence: Removed magic skill damage from the skill.",
      "Shredder Trap: Changed to physical damage.",
      "Shredder Trap: Lowered tick frequency from 0.25 second to 0.4 second.",
      "Shredder Trap - Bits And Pieces: Buffed proc chance from 3% to 4% per point.",
      "Shredder Trap - Ripping Shredder Blade: Buffed bleed damage from 15% to 20% per point but added a 4% proc chance.",
      "Shredder Trap - Forging Hands: Changed from FCR to critical chance (3% per point) + critical damage (20% per point).",
      "Shredder Trap - Cutting Power: Buffed armor break from 15% to 20% and proc chance from 3% to 4% per point.",
      "Shredder Trap - Slay The Wounded: Buffed damage to bleeding from 10% to 15% per point.",
      "Shredder Trap - Circular Cutting: Nerfed projectiles from 2 to 1 + (1 per point) and added 15% damage scaling to the node."
    ]
  },
  {
    "title": "Demonspawn",
    "entries": [
      "Blood Surge - Rays of Blood: Now max 5 procs per beam.",
      "Bone Fragments - Bone Frenzy: Buffed proc chance from 3% to 4% per point.",
      "Bone Fragments - Bone Cannonade: Buffed proc chance from 3% to 4% per point.",
      "Bone Fragments - Blood Dipped Fragments: Buffed bleed damage from 15% to 35% per point.",
      "Bone Fragments - Exo Skeletal: Buffed damage scaling from 15% to 30% per point.",
      "Bone Fragments - Carved Fragments: Buffed damage to bleeding from 10% to 20% per point.",
      "Bone Fragments - Smart Bone: Buffed damage scaling from 45% to 65% per point.",
      "Bone Fragments - Bone Altar: Buffed damage scaling from 15% to 25% per point.",
      "Bone Fragments - Demons Grip: Buffed damage scaling from 15% to 35% per point.",
      "Bone Storm - Razor Sharp: Buffed bleed damage from 15% to 35% per point.",
      "Bone Storm - Sacrificial Lamb: Buffed damage to bleeding from 10% to 15% per point.",
      "Bone Storm - Infiltrate Their Core: Buffed arcane break from 15% to 30% per point.",
      "Bone Storm - Devil´s Favourite: Buffed damage scaling from 15% to 30% per point.",
      "Bone Storm - Spontaneous Dislocation: Buffed proc chance from 3% to 4% per point.",
      "Bone Storm - Cycloning Bones: Buffed damage scaling from 15% to 25% and proc chance from 5% to 6% per point.",
      "Bone Storm - Bone Tornado: Buffed damage scaling from 20% to 40% per point.",
      "Bone Storm - Everlasting Storm: Buffed damage from 20% to 40% per point.",
      "Bone Storm - Bone Devils: Buffed damage scaling from 50% to 60% per point.",
      "Blood Surge - Blood Fervor: Buffed burning damage from 15% to 35% per point.",
      "Blood Surge - Asphyxiating Vessels: Buffed arcane break from 15% to 30% per point.",
      "Blood Surge - Vein Pressure: Buffed critical damage from 20% to 25% per point.",
      "Blood Surge - Hematopoiesis: Added 15% damage scaling to the node.",
      "Blood Surge - Bloodline: Buffed damage scaling from 25% to 45% per point.",
      "Blood Bolts - Hemophilia: Buffed bleed damage from 15% to 35% per point.",
      "Blood Bolts - Demonic Formula: Buffed proc chancew from 3% to 4% per point."
    ]
  },
  {
    "title": "Shaman",
    "entries": [
      "Meteor Shower: Nerfed the projectile amount from 30 to 20.",
      "Meteor Shower: Increased meteor falling speed.",
      "Meteor Shower: Now spawns 2 meteors per frame.",
      "Meteor Shower - Storm of Comets: Nerfed projectile amount from 3x to 2x.",
      "Meteor Shower - Storm of Comets: Buffed damage from 40% to 70% per point.",
      "Meteor Shower - Meteor Strike: Buffed damage scaling from 8% to 10% per point.",
      "Meteor Shower - Concentrated Shattering: Buffed elemental break from 10% to 17.5% per point.",
      "Meteor Shower - Colossus Destroyer: Buffed damage to bosses from 10% to 15% per point.",
      "Meteor Shower - Astroheated Shower: Buffed damage from 15% to 35% per point.",
      "Meteor Shower - Back Into Orbit: Buffed to 3 + (1 projectile per point)",
      "Meteor Shower - Rain from Hell: Buffed burning damage from 50% to 100% per point.",
      "Tornado - Flowing Spiral: Buffed proc chance from 3% to 4% per point.",
      "Tornado - Punishing Tempest: Buffed damage to stunned from 10% to 20% per point.",
      "Tornado - Storm Growth: Buffed damage scaling from 8% to 10% per point.",
      "Tornado - Storm Growth: Buffed size scaling from 8% to 10% per point.",
      "Tornado - Splitting Cyclone: Buffed damage scaling from 25% to 37.5% per point.",
      "Tornado - Absolute Tempest: Buffed damage scaling from 15% to 25% per point.",
      "Storm Totem - Storm Current: Buffed stasis damage from 15% to 20% per point.",
      "Storm Totem - Storm Current: Buffed proc chance from 3% to 4% per point.",
      "Storm Totem - Storm God: Buffed damage scaling from 8% to 10% per point.",
      "Storm Totem - Connected by Storm: Buffed damage scaling from 20% to 40% per point.",
      "Storm Totem - Electro Shock: Buffed stasis damage from 10% to 15% per point.",
      "Storm Totem - Storming Bolt: Buffed proc chance from 3% to 4% per point.",
      "Storm Totem - Collapsing Thunder: Buffed damage to stunned from 10% to 15% per point.",
      "Storm Totem - Swift Storm Totem: Buffed damage scaling from 25% to 35% per point.",
      "Storm Totem - Charged Totem: Added 20% damage scaling to the node.",
      "Storm Totem - Surging Sentry: Added 15% damage scaling to the node.",
      "Fire Totem - Paralyzing Napalm: Buffed damage scaling from 20% to 35% per point.",
      "Fire Totem - Multiplying Fire: Added 15% damage scaling to the node.",
      "Fire Totem - Homing Flames: Buffed damage scaling from 25% to 60% per point.",
      "Fire Totem - Firestorm Totems: Buffed damage scaling from 15% to 40% per point.",
      "Earth Totem - Wind Totem: Buffed damage scaling from 18% to 30% per point.",
      "Earth Totem - The Rolling Stones: Buffed damage scaling from 30% to 40% per point.",
      "Earth Totem - Fragmented Volley: Buffed damage scaling from 12.5% to 20% per point."
    ]
  },
  {
    "title": "White Mage",
    "entries": [
      "Burst of Light - Blinding Light: Fixed the node + changed to extra damage + stun on proc.",
      "Chain Of Holy Lightning - Recursive Light: Buffed damage from 30% to 40% per point",
      "Satan's Mark - Satanic Transe: Buffed amount of stacks per point from 1 to 2 but reduced max points from 5 to 3.",
      "Black Mass - Cult Bishop: Increased base projectile speed by 30%",
      "Mana Orb - Energy Orbit: Buffed conversion from 25% to 50% per point.",
      "Shadow Bolt - Consuming Flames: Buffed shadow burn damage from 25% to 35% per point.",
      "Shadow Bolt - Shadow Dispair: Buffed arcane break from 25% to 30% and proc chance from 3% to 4% per point.",
      "Shadow Bolt - Flames of Corruption: Buffed damage to shadow burn from 15% to 20% per point.",
      "Restless Spirits - Soul Termination: Doubled the area of effect radius of the explosion.",
      "Restless Spirits - Shadowflame Affliction: Buffed shadowburn damage from 15% to 35% per point.",
      "Restless Spirits - Hexbound Spirits: Buffed damage scaling from 20% to 40% per point.",
      "Restless Spirits - Shattering Spirits: Buffed arcane break from 15% to 30% per point.",
      "Soul Spurn - Shattering Destruction: Buffed proc chance from 3% to 4% per point.",
      "Soul Spurn - Purgatory: Fixed arcane break not working per tick.",
      "Soul Spurn - Purgatory: Buffed damage from 20% to 33% per point",
      "Soul Spurn - Repeating Reaping: Buffed damage scaling from 15% to 30% per point.",
      "Soul Spurn - Shattering Destruction: Buffed arcane break from 15% to 35% per point."
    ]
  },
  {
    "title": "Marauder",
    "entries": [
      "Crazy Grapple: Buffed base FCR from 1.75 to 2.25. (We will re-work the skill for season 8)",
      "Heavy Ball - Terrain Collision: Nerfed trails to 2 + (1 per point)",
      "Heavy Ball - Terrain Collision: Buffed burning damage from 50% to 75% per point.",
      "Heavy Ball - Heavy Swing: Now benefits from multi wield node.",
      "Bombardment - Casual Bombing: Buiffed damage from 15% to 25% per point.",
      "Bombardment - Casual Bombing: Now scales extra damage instead of a portion of maximum, changed scaling from 20% \"of total\" to 15% extra.",
      "Bombardment - Casual Bombing: Now adds projectiles into the singular arc.",
      "Bombardment - Can now change direction mid cast",
      "Chain Trap - Betrayal: Changed from \"of total\" to just extra, 80% > 40% damage scaling.",
      "Chain Trap - C4 Charged Tip: Changed from \"of total\" to just extra, 25% > 15% damage scaling.",
      "Chain Trap - Spinning Tip: Now correctly works with the nodes: Efficient Reel, Longer Chains and Serrated Chaintrap.",
      "Chain Trap - Rusty Chain Tip: Now also applies the damage from your skill \"Serrated Chains\" when proccing.",
      "Chain Trap - Sharpened Tip: Buffed bleed damage from 25% to 45% per point.",
      "Chain Trap - Sharpened Tip: Buffed damage scaling from 35% to 50% per point.",
      "Chain Trap - Betrayal: Buffed damage scaling from 40% to 75% per point.",
      "Bouncing Grenade - Nitroglycerine Solution: Buffed damage scaling from 8% to 10% per point.",
      "Bouncing Grenade - Ace Up Your Sleeve: Buffed proc chance from 3% to 4% per point.",
      "Bouncing Grenade - Sharp Shrapnels: Buffed fire break scaling from 15% to 25% per point.",
      "Bouncing Grenade - Sharp Shrapnels: Buffed proc chance from 3% to 4% per point.",
      "Bouncing Grenade - Flammable Charge: Buffed burning damage from 15% to 25% per point.",
      "Bouncing Grenade - Resetting the Fuse: Buffed damage scaling from 40% to 50% per point.",
      "Bouncing Grenade - Blazing Rebound: Buffed damage scaling from 35% to 42.5% per point.",
      "Bouncing Grenade - Fiery Charge: Buffed burning damage from 50% to 80% per point.",
      "Bouncing Grenade - Fiery Charge: Fixed, didnt work at all.",
      "Bouncing Grenade - Coast to Coast: Buffed damage scaling from 15% to 25% per point.",
      "The Big Bo-oM - Boomage: Buffed damage scaling from 8% to 10% per point.",
      "The Big Bo-oM - Double Charges: Buffed damage scaling from 5% to 8% per point.",
      "The Big Bo-oM - Pyro Enthusiast: Buffed fire break from 15% to 30% per point.",
      "The Big Bo-oM - Pyro Enthusiast: Buffed proc chance from 3% to 4% per point.",
      "The Big Bo-oM - Swift Booming: Buffed projectile speed from 15% to 20% per point.",
      "The Big Bo-oM - Burn the Arena: Buffed burning damage from 15% to 35% per point.",
      "The Big Bo-oM - Burn the Arena: Buffed proc chance from 3% to 4% per point.",
      "The Big Bo-oM - More Heat: Buffed damage to burning from 10% to 15% per point.",
      "The Big Bo-oM - Rollin Rollin Rollin: Buffed damage scaling from 25% to 40% per point.",
      "The Big Bo-oM - Crash Boom: Buffed damage scaling from 25% to 75% per point.",
      "The Big Bo-oM - Molten Boom: Buffed burning damage from 25% to 75% per point.",
      "The Big Bo-oM - Bouncing Boom: Added 20% damage scaling to the node.",
      "The Big Bo-oM - Scattering Boom: Buffed damage scaling from 40% to 50% per point.",
      "The Big Bo-oM - Scattering Boom: Added a 1 second cooldown to the skill due to performance issues + damage buff",
      "Crazy Grapple: Lowered the height, increased maximum range increasing projectile speed.",
      "Crazy Grapple - Explosive Grapple: Buffed fire break from 25% to 40% per point.",
      "Crazy Grapple - Thorns of Sorrow: Buffed bleed damage from 50% to 100% per point.",
      "Crazy Grapple - Thorn Spikes: Buffed damage scaling from 8% to 20% per point.",
      "Serrated Chains - Rust Poisoning changed from \"chance to inflict poison\" to \"chance to increase tick frequency\"",
      "Serrated Chains - Rusted Thorns: Nerfed frequency from 25% to 18% per point."
    ]
  },
  {
    "title": "Plague Doctor",
    "entries": [
      "Surgical Blood Letting: all nodes now provide increased total bleed damage since bleed already comes from malpractice",
      "Miasma - Dense Haze: Fixed, now properly increases tick frequency",
      "Crematus - Bursting Pustules: Removed shotgunning and optimized performance",
      "Crematus - Bursting Pustules: Nerfed area of effect scaling from 4% to 3% per point.",
      "Crematus - Bursting Pustules: Buffed damage scaling from 8% to 12.5% per point.",
      "Crematus - Spiraling Cremation: Nerfed base projectile size by 50%",
      "Crematus - Spiraling Cremation: Buffed damage scaling from 20% to 30% per point.",
      "Crematus - Spiraling Cremation: Nerfed duration from 4 seconds to 3.15 seconds.",
      "Crematus - Corrosive Burning: Changed from burning to poisoned + buffed from 15% to 35% per point.",
      "Crematus - Corrosive Embers: Buffed poison break scaling from 15% to 25% per point.",
      "Crematus - Toxiamplified Alveoli: Nerfed area of effect scaling from 15% to 8% per point.",
      "Plague Master: Fixed the effect, caused issues. Now also inherits modifiers from sub nodes on the chain.",
      "Plague of Rats - Gnawing Rodents: Buffed damage from 8% to 10% per point.",
      "Plague of Rats - Plague Carriers: Buffed poisoned damage from 20% to 35% per point.",
      "Plague of Rats - Painful Bite: Buffed critical damage from 20% to 30% per point.",
      "Plague of Rats - Leptospirosis: Buffed poison break from 15% to 30% per point.",
      "Plague of Rats - Ratsunami: Added 15% per point damage scaling to the node.",
      "Plague of Rats - Rat Den: Buffed damage scaling from 15% to 40% per point.",
      "Plague of Rats - Spreading Infestation: Buffed poisoned damage scaling from 30% to 50% per point.",
      "Plague of Rats - Spreading Infestation: Fixed rat procs, now pierce correctly.",
      "Plague of Rats - Ratocalypse: Added 15% per point damage scaling to the node.",
      "Plague of Rats - Ratocalypse: Now unleashes multiple waves of rats towards the target location"
    ]
  },
  {
    "title": "Shield Lancer",
    "entries": [
      "Honed Defenses - Royal Defense: The royal guards now deal 10% of honed defense´s damage.",
      "Glorious Strike - Piercing Thrust: Buffed bleed scaling from 15% to 30% and proc chance from 3% to 4% per point.",
      "Glorious Strike - Brutal Knight: Buffed critical damage scaling from 20% to 25% per point.",
      "Glorious Strike - Leave No Survivors: Buffed extra damage to bleeding from 10% to 15% per point.",
      "Glorious Strike - Javelin Harbringer: Buffed proc chance from 3% to 6% per point.",
      "Battle Charge - Rampaging Assault: Buffed damage scaling from 15% to 30% and proc chance from 3% to 5% per point.",
      "Battle Charge - Spear Dasher: Buffed damage scaling from 25% to 40% per point.",
      "Battle Charge - Blunt Force Trauma: Buffed extra damage to stunned from 10% to 20% per point.",
      "Battle Charge - Bulldozer: Buffed damage scaling from 25% to 45% per point.",
      "Battle Charge - Ground Slammer: Buffed damage scaling from 40% to 65% per point.",
      "Crushing Lance - Sharp Point: Buffed damage scaling from 8% to 10% per point.",
      "Crushing Lance - Finishing Stagger: Buffed extra damage to stunned from 10% to 20% per point.",
      "Crushing Lance - Two for One: Buffed proc chance from 3% to 4% per point.",
      "Crushing Lance - Pulverizing Shock: Buffed armor break from 15% to 25% and proc chance from 3% to 4% per point.",
      "Crushing Lance - Scorching Quake: Buffed burning damage from 15% to 30% and proc chance from 3% to 4% per point.",
      "Crushing Lance - Marked for Javelin Strike: Buffed damage scaling from 40% to 75% per point.",
      "Lance Thrust - Battle Experienced: Buffed damage scaling from 8% to 12% per point.",
      "Lance Thrust - Punctured Organs: Buffed bleed damage from 15% to 25% and proc chance from 3% to 4% per point.",
      "Lance Thrust - Trust in the Thrust: Buffed damage scaling from 25% to 40% per point.",
      "Shield Wall - Noxious Shields: Buffed poisoned damage from 15% to 30% and proc chance from 3% to 4% per point.",
      "Shield Wall - Dissolving Corrosion: Buffed extra damage to poisoned from 10% to 30% per point."
    ]
  },
  {
    "title": "Jötunn",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Portal of Ice: Added a 1 second cooldown.",
      "Frozen Boulder - Boulder Lob: Buffed projectile speed from 10% to 15% per point.",
      "Frozen Boulder - Petrifying Frost: Buffed damage scaling from 8% to 10% per point.",
      "Frozen Boulder - Shattering Frost: Buffed cold break from 30% to 35% and proc chance from 3% to 4% per point.",
      "Frozen Boulder - Rolling Winterstone: Buffed damage scaling from 35% to 50% per point.",
      "Frozen Boulder - Overgrowing Boulder: Buffed damage scaling from 20% to 26.5% per point + now slows the boulder projectile speed by 25%",
      "Frozen Boulder - Boulder Barrage: Changed projectiles from 2 to 2 + (1 per point) and buffed damage scaling from 20% to 35% per point.",
      "Breath of Ice - Crumbling Winds: Buffed cold break from 15% to 35% per point.",
      "Breath of Ice - Expansive Gasp: Buffed area of effect scaling from 15% to 20% per point.",
      "Breath of Ice - Iron Frost Lungs: Buffed duration from 10% to 15% per point.",
      "Breath of Ice - Frozen Exhale: Buffed damage scaling from 5% to 6% per point.",
      "Breath of Ice - Freezing Point: Buffed extra damage to frozen from 10% to 15% per point.",
      "Breath of Ice - Ice Skating: Buffed damage scaling from 20% to 40% and proc chance from 3% to 4% per point.",
      "Breath of Ice - Frostbourne Winds: Buffed frostbite damage from 15% to 35% per point.",
      "Breath of Ice - Cascading Exhale: Buffed proc chance from 3% to 4% per point.",
      "Breath of Ice - Frostbitten Lungs: Buffed frequency from 8% to 12.5% per point and duration from 15% to 17.5% per point.",
      "Breath of Ice - Absolute Control: Added 15% damage scaling to the node.",
      "Breath of Ice - Frosted Throat: Buffed critical chance from 8% to 10% and critical damage from 35% to 50% per point.",
      "Orb of Frost - Cold Snap: Buffed cold break from 25% to 35% and proc chance from 3% to 4% per point.",
      "Orb of Frost - Hypothermia: Buffed extra damage to frozen from 5% to 8% per point.",
      "Orb of Frost - Glacial Shredder: Buffed damage scaling from 25% to 60% per point.",
      "Orb of Frost - Chaining Frost: Buffed targets from 5 to 6 per point.",
      "Orb of Frost - Orb of Duality: Buffed damage scaling from 15% to 20% per point.",
      "Blizzard - Frost Domain: Buffed area of effect scaling from 15% to 17.5% per point.",
      "Blizzard - Crackling Ice: Buffed damage scaling from 25% to 40% and proc chance from 3% to 4% per point.",
      "Blizzard - Corrosive Ice: Buffed frostbite damage scaling from 22.5% to 30% and proc chance from 3% to 4% per point.",
      "Blizzard - Hypothermic Temperature: Buffed cold break from 15% to 35% per point.",
      "Blizzard - Snowstorm Maelstrom: Buffed frostbite damage from 40% to 50% per point.",
      "Blizzard - Frost Flurries: Buiffed damage scaling from 15% to 22.5% per point.",
      "Blizzard - Frigid Eruption: Buffed damage scaling from 20% to 30% per point.",
      "Blizzard - Snowmageddon: Buffed frequency from 2% to 2.5% per point.",
      "Flash Freeze - Fractured Ice: Buffed proc chance from 3% to 4% per point.",
      "Flash Freeze - Nordic Frenzy: Buffed extra damage to frozen from 10% to 15% per point.",
      "Flash Freeze - Freezing Rage: Buffed damage scaling from 2% to 2.5% and attack speed from 1% to 1.25% per point.",
      "Flash Freeze - Eternal Cascade: Buffed proc chance from 3% to 4% per point.",
      "Flash Freeze - Icicle Bombardment: Buffed damage scaling from 25% to 45% per point.",
      "Flash Freeze - Recurving Stalactites: Buffed damage scaling from 25% to 32.5% per point.",
      "Flash Freeze - Swirling Winter Shard: Buffed frequency from 20% to 22.5% per point.",
      "Flash Freeze - Cold Flash Volley: Buffed damage scaling from 30% to 45% per point."
    ]
  },
  {
    "title": "Illusionist",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Sand Guardians: Buffed damage scaling from 6.25 to 7 per point.",
      "Sand Guardians - Hardened Sand Stone: Buffed damage scaling from 8% to 10% per point.",
      "Sand Guardians - Desert´s Gladiators: Buffed proc chance from 3% to 4% per point.",
      "Sand Guardians - Reserve Army: Buffed proc chance from 3% to 4% per point.",
      "Sand Guardians - Dashing Sand Strike: Buffed damage scaling from 30% to 45% per point.",
      "Sand Guardians - Sand´s Edge: Buffed critical chance from 3% to 4% and critical damage from 20% to 30% per point.",
      "Sand Guardians - Guardian Nevermore: Buffed damage scaling from 25% to 40% per point.",
      "Sand Guardians - Sand Mages: Buffed damage scaling from 15% to 32.5% and range from 10% to 17.5% per point.",
      "Sand Guardians - Sacrifice For The Throne: Buffed magic break scaling from 20% to 30% per point.",
      "Sand Guardians - Guardian´s of the Orbital Sand: Buffed damage scaling from 25% to 50% per point.",
      "Sand Guardians: Piercing Sand now properly works on sand guardians.",
      "Link of Sand: Piercing Sand now properly works on sand guardians.",
      "Circle of Guardians - Battalion of Guardians: Changed from 1 to 2 + (1 per point).",
      "Circle of Guardians - Devastating Lunge: Buffed proc chance from 3% to 4% per point.",
      "Circle of Guardians - Magic Infused Blade: Buffed magic break from 15% to 25% per point.",
      "Circle of Guardians - Ancient Goliath: Buffed damage scaling from 20% to 40% per point.",
      "Circle of Guardians - Arcanic Tether: Buffed damage scaling from 25% to 35% per point.",
      "Circle of Guardians - Seven Nation Army: Buffed damage scaling from 30% to 45% per point.",
      "Age Proliferation - Burning Aging: Buffed shadow burn damage from 20% to 35% per point.",
      "Age Proliferation - Breaking The Cycle: Buffed arcane break from 20% to 30% and proc chance from 3% to 4% per point.",
      "Age Proliferation - Arcane Echo: Buffed damage scaling from 50% to 65% per point.",
      "Age Proliferation - Scorching Magic: Buffed burning damage scaling from 45% to 75% per point.",
      "Combat Order: Buffed damage scaling from 1% to 8.5% + (1.5% per point).",
      "Gravitational Slam - Self Help: Helped the skill by changing the monster life scaling to just damage scaling."
    ]
  },
  {
    "title": "Exo",
    "entries": [
      "Solar Dash - Bursting Flames: Fireballs now bounce off of terrain.",
      "Whiplash: Fixed mask",
      "Tsunami - Nerfed base size by 25%",
      "Tsunami - Buffed base speed by 0.5",
      "Tsunami - Arctic Aqua: Buffed frostbite damage from 20% to 30% per point.",
      "Tsunami - Ramping Waves: Buffed scaling from 4.5% to 6.5% per point.",
      "Tsunami - Water Spout: Buffed damage from 25% to 50% and proc chance from 3% to 4% per point.",
      "Tsunami - Chaining Waves: Buffed faster cast rate from 6% to 8% per point.",
      "Tsunami - Chaining Waves: Added 12.5% projectile speed to the node.",
      "Tsunami - Salt Balance: Buffed damage to frostbite from 12.5% to 15% per point.",
      "Tsunami - Giant Waves: Buffed area of effect scaling from 15% to 20% per point.",
      "Tsunami - The Last Waterbender: Added 25% damage scaling to the node.",
      "Tsunami - Watery Turbulence: Added 15% damage scaling to the node.",
      "Asteroid - A Gift From Space: Buffed critical damage scaling from 22.5% to 30% per point.",
      "Asteroid - Sharp Asteroids: Buffed frostbite damage scaling from 18.5% to 35% per point.",
      "Asteroid - Frozen Core: Buffed cold break scaling from 15% to 30% per point.",
      "Asteroid - Cold Shatter Impact: Buffed damage to frostbite from 20% to 30% per point.",
      "Asteroid - Perseids: buffed damage from 25% to 50% per point.",
      "Asteroid - Galactic Cataclysm: Added 30% damage scaling to the node.",
      "Asteroid - Geomagnetic Reversal: Added 25% damage scaling to the node.",
      "Asteroid - Wave of Asteroids: Added 15% damage scaling to the node.",
      "Lunar Orbit - Celestial Collapse: Buffed damage scaling from 30% to 50% per point.",
      "Lunar Orbit - Lunar Cycle: Buffed cold break from 20% to 30% per point.",
      "Lunar Orbit - Tidal Waves: Buffed damage scaling from 25% to 50% per point.",
      "Lunar Orbit - Lunar Architect: Added 15% damage scaling to the node."
    ]
  },
  {
    "title": "Butcher",
    "entries": [
      "Holy Form & Unholy Form: Are now instant casts.",
      "Daisy´s Call: Lowered cooldown from 2 seconds to 0.75 second.",
      "Ending Fate: Buffed proc chance from 15% to 18% per point.",
      "Slicing Throw: Buffed cooldown from 1.5s to 1s",
      "Slicing Throw: Changed scaling from 32% + (28% per point) to 170% + (30% per point).",
      "Slicing Throw: Buffed base blade size by 10%",
      "Slicing Throw: Buffed base blade speed from 6.5 to 7.",
      "Slicing Throw - Cut in Half: Buffed damage scaling from 8% to 10% per point.",
      "Slicing Throw - Precision Blade: Now passively increases your dexterity.",
      "Slicing Throw - One Swift Strike: Nerfed projectile speed from 15% to 12.5% and buffed critical damage scaling from 15% to 20% per point.",
      "Slicing Throw - Cuts and Wounds: Buffed armor break from 15% to 25% and proc chance from 3% to 4% per point.",
      "Slicing Throw - Splitting Chain: Buffed proc chance from 3% to 4% per point.",
      "Slicing Throw - Burn The Corpses: Buffed burning damage from 15% to 30% and proc chance from 3% to 4% per point.",
      "Slicing Throw - Executioner´s Apprentice: Buffed execution damage from 1% to 1.3% per point.",
      "Slicing Throw - Bloody Combustion: Buffed damage scaling from 30% to 40% and proc chance from 2% to 3% per point.",
      "Slicing Throw - Splitting Blade: Buffed damage scaling from 30% to 40% and changed projectiles from 2 per point to 2 + (1 per point).",
      "Slicing Throw - Bladesaw Massacre: Nerfed projectile scaling from 3 per point to 4 + (1 per point).",
      "Slicing Throw - Daisy´s Regards: Buffed burning damage from 50% to 75% per point.",
      "Furious Strike -  Widespread Epidemic: Buffed rabies scaling from 5% to 8% per point.",
      "Furious Strike - Down With Sickness: Buffed poisoned damage scaling from 15% to 35% and proc chance from 3% to 4% per point.",
      "Furious Strike - Strike of Hate: Buffed damage scaling from 8% to 12.5% per point.",
      "Furious Strike - Blade Uppercut: Buffed damage scaling from 20% to 50% and proc chance from 3% to 4% per point.",
      "Furious Strike - Serious Fever: Buffed stacks from 1 per point to 2 + (1 per point).",
      "Furious Strike - Fueled Anger: Buffed attack speed scaling from 6% to 10% per point.",
      "Furious Strike - Mediocre Unit: Buffed proc chance from 3% to 4% per point.",
      "Furious Strike - Stay Still: Buffed damage to stunned from 10% to 20% per point.",
      "Furious Strike - Spread the Sword: Buffed proc chance from 3% to 4% per point.",
      "Furious Strike - Consumed by Hatred: Buffed damage scaling from 25% to 35% per point.",
      "Furious Strike - Flames of Fury: Buffed burning damage from 40% to 60% per point.",
      "Furious Strike - Sick To The Core: Buffed damage scaling from 35% to 42.5% and changed stacks from 3 per point to 4 + (1 per point).",
      "Furious Strike - The Absolute Unit: Nerfed fire damage scaling from 20% to 1% per point.",
      "Chain Rip: Lowered cooldown from 3 seconds to 1.25 seconds.",
      "Chain Rip - Torture The Skin: Buffed bleed damage from 15% to 40% and proc chance from 3% to 4% per point.",
      "Chain Rip - Chains of Hatred: Buffed damage scaling from 8% to 15% per point.",
      "Chain Rip - Ranged Suffering: Buffed range from 15% to 17.5% per point.",
      "Chain Rip - Break The Flesh: Buffed armor break scaling from 10% to 40% per point.",
      "Chain Rip - They Never Know What Hit Them: Buffed damage to stunned from 15% to 35% and proc chance from 3% to 4% per point.",
      "Chain Rip - Prey on the Weak: Added 100% critical damage per point scaling to the node.",
      "Chain Rip - Carcass Rip: Buffed damage scaling from 25% to 35% per point.",
      "Brutalizing Slash: Added mechanic; Now unleashes a ripple of blood on hit.",
      "Brutalizing Slash - Butchering Skill: Added 3% crit chance per point to the node.",
      "Brutalizing Slash - Bone Breaker: Buffed damage scaling from 8% to 10% per point.",
      "Brutalizing Slash - Descent To Madness: Buffed attack speed scaling from 6% to 7.5% per point.",
      "Brutalizing Slash - Skull Splitter: Buffed critical damage scaling from 20% to 30% per point.",
      "Brutalizing Slash - Bleeding Prey: Buffed damage to bleeding from 10% to 15% per point.",
      "Brutalizing Slash - Pummeling Slashwave: Buffed damage scaling from 12.5% to 22.5% and bleed damage from 20% to 30% per point.",
      "Brutalizing Slash - Pain Mongering: Added 1 extra bleeding stack per point to the node.",
      "Brutalizing Slash - Gutting Frenzy: Buffed conversion scaling from 60% to 75% and proc chance from 6% to 7% per point.",
      "Butcher´s Hook: Lowered cooldown from 8 seconds to 6.75 seconds.",
      "Butcher´s Hook - Fresh Meat: Buffed bleed damage from 15% to 30% and proc chance from 3% to 4% per point.",
      "Butcher´s Hook - Pierce the Torso: Buffed armor break from 15% to 30% and proc chance from 3% to 4% per point.",
      "Butcher´s Hook - Hell Sent: Buffed movement speed from 10% to 15% per point.",
      "Butcher´s Hook - Immaculate Butcher: Buffed critical damage scaling from 20% to 30% per point.",
      "Butcher´s Hook - Concussive Blow: Buffed damage scaling from 2% to 2.5% per point.",
      "Butcher´s Hook - Master of Meat Hooks: Added 15% damage scaling to the node.",
      "Butcher´s Hook - Welcome to Hell: Buffed damage scaling from 25% to 40% per point.",
      "Submerged Knives: Lowered cooldown from 8 seconds to 1.5 seconds.",
      "Submerged Knives - Agravating Wounds: Buffed damage scaling from 8% to 11% per point.",
      "Submerged Knives - Jugular Cut: Buffed damage to stunned from 10% to 15% per point.",
      "Submerged Knives - The Bigger They Are: Buffed damage to bosses from 10% to 25% per point.",
      "Submerged Knives - Blunt Cleaver: Buffed proc chance from 3% to 4% per point.",
      "Submerged Knives - Meat Skewer: Buffed proc chance from 3% to 4% per point.",
      "Submerged Knives - Tidal Knives: Added 15% damage scaling to the node and changed waves from 3 per point to 3 + (1 per point).",
      "Submerged Knives - Sudden Chaining: Buffed damage from 35% to 40% and proc chance from 5% to 6% per point.",
      "Submerged Knives - Knife Hoarder: Buffed bleed damage from 50% to 75% per point.",
      "Blender: Lowered cooldown from 12 seconds to 8 seconds.",
      "Blender - Industrial Sized: Buffed area of effect scaling from 15% to 17.5% per point.",
      "Blender - Obsidian Blades: Buffed critical damage scaling from 20% to 32.5% per point.",
      "Blender - Attachment Malfunction: Buffed proc chance from 3% to 4% per point.",
      "Blender - It Will Blend: Buffed damage to bleeding from 10% to 17.5% per point.",
      "Blender - AI Empowered Nano Blenders: Buffed projectiles from 1 per point to 2 + (1 per point).",
      "Blender - Blenderang: Buffed damage scaling from 25% to 50% per point.",
      "Blender - Attachable Micro Blades: Buffed damage scaling from 10% to 35% per point.",
      "Chain Swing: Lowered cooldown from 2 seconds to 1 second."
    ]
  },
  {
    "title": "Stormweaver",
    "entries": [
      "Fixed proc effects on sub skills, every proc now properly inherits all applying modifiers",
      "Storm Bolt - Bolts of Devastation: Buffed damage scaling from 8% to 10% per point.",
      "Storm Bolt - Shocked Steps: Changed to Surging Colossus, gain 22.5% increased damage to bosses per point.",
      "Storm Bolt - Storm Claw: Buffed damage scaling from 50% to 60% per point.",
      "Storm Bolt - Bouncing Charge: Buffed damage scaling from 15% to 25% per point.",
      "Storm Bolt - Pulsating Bolt: Buffed damage scaling from 35% to 45% per point.",
      "Storm Bolt - Magnetize: Buffed damage scaling from 30% to 40% per point.",
      "Storm Bolt - Magnetize: Nerfed area of effect from 35% to 10% per point.",
      "Charged Bolts - Weakening Charge: Buffed lightning break from 15% to 30% per point.",
      "Charged Bolts - Additive Voltage: Buffed extra projectiles proc chance per point from 3% to 5% per point.",
      "Charged Bolts - Loaded Thunder: Buffed proc chance from 5% to 8% & area of effect from 20% to 25% per point",
      "Pulsing Charge - Buffed scaling from 1.75 to 3 per point",
      "Pulsing Charge - Buffed area of effect radius slightly"
    ]
  }
]